In [33]:
import pandas as pd
course_name = ['Data Science', 'Machine Learning', 'Big Data', 'Data Engineer']
duration = [2,3,6,4]
df = pd.DataFrame(data = {'course_name' : course_name, 'duration' : duration})

In [34]:
df

        course_name  duration
0      Data Science         2
1  Machine Learning         3
2          Big Data         6
3     Data Engineer         4

In [35]:
print(df.iloc[1])

course_name    Machine Learning
duration                      3
Name: 1, dtype: object

2. What is the difference between the functions loc and iloc in pandas.DataFrame?

**Loc and iloc are two functions in Pandas that are used to slice a data set in a Pandas DataFrame. The function .loc is typically used for label indexing and can access multiple columns, while .iloc is used for integer indexing.**

3. Reindex the given dataframe using a variable, reindex = [3,0,1,2] and store it in the variable, new_df
then find the output for both new_df.loc[2] and new_df.iloc[2].

Did you observe any difference in both the outputs? If so then explain it.

In [139]:
df

        course_name  duration
0      Data Science         2
1  Machine Learning         3
2          Big Data         6
3     Data Engineer         4

In [145]:
df.loc[2]

course_name    Big Data
duration              6
Name: 2, dtype: object

In [149]:
df.iloc[2]

course_name    Big Data
duration              6
Name: 2, dtype: object

**loc** uses loc[2] number where is it written ishow their output and **iloc** counts index then shows the output

In [136]:
new_df = df.reindex([2,1,3,0])

In [141]:
new_df

        course_name  duration
2          Big Data         6
1  Machine Learning         3
3     Data Engineer         4
0      Data Science         2

In [138]:
new_df.loc[2]

course_name    Big Data
duration              6
Name: 2, dtype: object

In [137]:
new_df.iloc[2]

course_name    Data Engineer
duration                   4
Name: 3, dtype: object

Consider the below code to answer further questions:

import pandas as pd
import numpy as np
columns = ['column_1', 'column_2', 'column_3', 'column_4', 'column_5', 'column_6']
indices = [1,2,3,4,5,6]
#Creating a dataframe:
df1 = pd.DataFrame(np.random.rand(6,6), columns = columns, index = indices)

Q4. Write a code to find the following statistical measurements for the above dataframe df1:
(i) mean of each and every column present in the dataframe.
(ii) standard deviation of column, ‘column_2’

In [151]:
import pandas as pd
import numpy as np
columns = ['column_1', 'column_2', 'column_3', 'column_4', 'column_5', 'column_6']
indices = [1,2,3,4,5,6]
#Creating a dataframe:
df1 = pd.DataFrame(np.random.rand(6,6), columns = columns, index = indices)

(i) mean of each and every column present in the dataframe.

In [160]:
column_means = df1.mean()

column_means

column_1    0.679991
column_2    0.318629
column_3    0.433871
column_4    0.523029
column_5    0.723075
column_6    0.319889
dtype: float64

(ii) standard deviation of column, ‘column_2’

In [161]:
df1['column_2'].std()

0.25133022081758016

Replace the data present in the second row of column, ‘column_2’ by a string variable then find the
mean of column, column_2.
If you are getting errors in executing it then explain why.
[Hint: To replace the data use df1.loc[] and equate this to string data of your choice.]

answer6 - Rolling Window Functions: Perform calculations on a rolling window of fixed size.
Expanding Window Functions: Perform calculations on an expanding window from the beginning up to the current observation.
Exponentially Weighted Windows: Apply exponentially weighted calculations.

ans 7

In [162]:
import pandas as pd

current_date = pd.to_datetime("today")
current_month_year = current_date.strftime("%B %Y")
print(current_month_year)

June 2024

ans 8

In [163]:
import pandas as pd

# Input dates
date1 = pd.to_datetime(input("Enter the first date (YYYY-MM-DD): "))
date2 = pd.to_datetime(input("Enter the second date (YYYY-MM-DD): "))

# Calculate the difference
time_delta = date2 - date1

# Extract days, hours, and minutes
days = time_delta.days
hours = time_delta.seconds // 3600
minutes = (time_delta.seconds % 3600) // 60

print(f"Difference: {days} days, {hours} hours, and {minutes} minutes")

Difference: 366 days, 0 hours, and 0 minutes

In [165]:
import pandas as pd

# Prompt for file path and column details
file_path = input("Enter the file path: ")
column_name = input("Enter the column name to convert to categorical: ")
category_order = input("Enter the category order (comma-separated): ").split(',')

# Read the CSV file
df = pd.read_csv(file_path)

# Convert the specified column to categorical
df[column_name] = pd.Categorical(df[column_name], categories=category_order, ordered=True)

# Display sorted data
df_sorted = df.sort_values(by=[column_name])
print(df_sorted)

PermissionError: [Errno 13] Permission denied: 'E:\\Full Stack Data Science\\pandas'

In [36]:
import pandas as pd

ans 9

In [102]:
data = {'a':[1,2,3,4],
        'b':[4,5,6,7],
        'c':['mohan','sudh','krish','rohit']}

In [103]:
df1 = pd.DataFrame(data)

In [104]:
df1

   a  b      c
0  1  4  mohan
1  2  5   sudh
2  3  6  krish
3  4  7  rohit

In [40]:
df1.set_index('a',inplace=True)

In [41]:
df1

   b      c
a
1  4  mohan
2  5   sudh
3  6  krish
4  7  rohit

In [42]:
df1.reset_index()

   a  b      c
0  1  4  mohan
1  2  5   sudh
2  3  6  krish
3  4  7  rohit

In [100]:
data = {'a':[1,2,3,4],
        'b':[4,5,6,7],
        'c':['mohan','sudh','krish','rohit']}
df1 = pd.DataFrame(data,index=['a','b','c','d'])

In [44]:
for i in df1.iterrows():
    print(i)

('a', a        1
b        4
c    mohan
Name: a, dtype: object)
('b', a       2
b       5
c    sudh
Name: b, dtype: object)
('c', a        3
b        6
c    krish
Name: c, dtype: object)
('d', a        4
b        7
c    rohit
Name: d, dtype: object)

In [45]:
df1

   a  b      c
a  1  4  mohan
b  2  5   sudh
c  3  6  krish
d  4  7  rohit

In [46]:
for i,j in df1.iterrows():
    print(i,j)

a a        1
b        4
c    mohan
Name: a, dtype: object
b a       2
b       5
c    sudh
Name: b, dtype: object
c a        3
b        6
c    krish
Name: c, dtype: object
d a        4
b        7
c    rohit
Name: d, dtype: object

In [47]:
df1.reindex(['c','b','a','d'])

   a  b      c
c  3  6  krish
b  2  5   sudh
a  1  4  mohan
d  4  7  rohit

In [48]:
for i in df1.items():
    print(i)

('a', a    1
b    2
c    3
d    4
Name: a, dtype: int64)
('b', a    4
b    5
c    6
d    7
Name: b, dtype: int64)
('c', a    mohan
b     sudh
c    krish
d    rohit
Name: c, dtype: object)

In [57]:
df1['a']

a    1
b    2
c    3
d    4
Name: a, dtype: int64

In [56]:
[_ for _ in df1['a']]

[1, 2, 3, 4]

In [51]:
list(df1['a'])

[1, 2, 3, 4]

In [80]:
pd.set_option("display.max_colwidth",500)
df3 = pd.DataFrame({"disc":["I possess excellent analytical skills, allowing me to work with large datasets and derive meaningful insights. My communication skills enable me to present complex data clearly and effectively. I am adept at critical thinking, paying close attention to detail, and have strong math skills for accurate numerical analysis.","my name is faraz","I am learnig data science"]})

In [81]:
df3

                                                                                                                                                                                                                                                                                                                                disc
0  I possess excellent analytical skills, allowing me to work with large datasets and derive meaningful insights. My communication skills enable me to present complex data clearly and effectively. I am adept at critical thinking, paying close attention to detail, and have strong math skills for accurate numerical analysis.
1                                                                                                                                                                                                                                                                                                                   my name is faraz
2                                                                                                                                                                                                                                                                                                          I am learnig data science

In [82]:
df3["length"] = df3["disc"].apply(len)

In [83]:
df3

,disc,length
0,"I possess excellent analytical skills, allowing me to work with large datasets and derive meaningful insights. My communication skills enable me to present complex data clearly and effectively. I am adept at critical thinking, paying close attention to detail, and have strong math skills for accurate numerical analysis.",321
1,my name is faraz,16
2,I am learnig data science,25

In [97]:
df3["Count"] = df3["disc"].apply(lambda x:len(x.split()))

In [98]:
df3

,disc,length,Count
0,"I possess excellent analytical skills, allowing me to work with large datasets and derive meaningful insights. My communication skills enable me to present complex data clearly and effectively. I am adept at critical thinking, paying close attention to detail, and have strong math skills for accurate numerical analysis.",321,48
1,my name is faraz,16,4
2,I am learnig data science,25,5

In [99]:
df

        course_name  duration
0      Data Science         2
1  Machine Learning         3
2          Big Data         6
3     Data Engineer         4

In [101]:
df1

   a  b      c
a  1  4  mohan
b  2  5   sudh
c  3  6  krish
d  4  7  rohit

In [105]:
df1

   a  b      c
0  1  4  mohan
1  2  5   sudh
2  3  6  krish
3  4  7  rohit

In [107]:
df1['a'].mean()

2.5

In [111]:
df1['b'].mean()

5.5

In [113]:
df1['a'].max()

4

In [118]:
df1['a'].mode()

0    1
1    2
2    3
3    4
Name: a, dtype: int64

In [119]:
df1['a'].median()

2.5

In [121]:
df1['a'].std() #standerd daviation

1.2909944487358056

In [ ]:
# pandas - window function

In [124]:
df4 = pd.DataFrame({"a":[3,2,4,2,1,5,7,3,8,9]})

In [125]:
df4

   a
0  3
1  2
2  4
3  2
4  1
5  5
6  7
7  3
8  8
9  9

In [126]:
df4['a'].rolling(window=3).mean()

0         NaN
1         NaN
2    3.000000
3    2.666667
4    2.333333
5    2.666667
6    4.333333
7    5.000000
8    6.000000
9    6.666667
Name: a, dtype: float64

In [127]:
df4['a'].rolling(window=2).mean()

0    NaN
1    2.5
2    3.0
3    3.0
4    1.5
5    3.0
6    6.0
7    5.0
8    5.5
9    8.5
Name: a, dtype: float64

In [128]:
df4['a'].rolling(window=1).mean()

0    3.0
1    2.0
2    4.0
3    2.0
4    1.0
5    5.0
6    7.0
7    3.0
8    8.0
9    9.0
Name: a, dtype: float64

In [129]:
df4['a'].rolling(window=1).sum()

0    3.0
1    2.0
2    4.0
3    2.0
4    1.0
5    5.0
6    7.0
7    3.0
8    8.0
9    9.0
Name: a, dtype: float64

In [130]:
df4['a'].rolling(window=1).median()

0    3.0
1    2.0
2    4.0
3    2.0
4    1.0
5    5.0
6    7.0
7    3.0
8    8.0
9    9.0
Name: a, dtype: float64

In [132]:
df4['a'].rolling(window=1).max()

0    3.0
1    2.0
2    4.0
3    2.0
4    1.0
5    5.0
6    7.0
7    3.0
8    8.0
9    9.0
Name: a, dtype: float64

In [133]:
df4['a'].rolling(window=1).min()

0    3.0
1    2.0
2    4.0
3    2.0
4    1.0
5    5.0
6    7.0
7    3.0
8    8.0
9    9.0
Name: a, dtype: float64